Revit 2027 API
BuiltInFailures.StructuralConnectionFailures.StructuralConnectionCannotGenerate Property
 Could not create Structural Connection Handler
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StructuralConnectionCannotGenerate { get; }
Public Shared ReadOnly Property StructuralConnectionCannotGenerate As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StructuralConnectionCannotGenerate {
	FailureDefinitionId^ get ();
}
static member StructuralConnectionCannotGenerate : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace